## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                           NAME                            |
|----------|-----------------------------------------------------------|
| delete   | `aws_docdb_cluster_instance.ai-answers-docdb-instance[1]` |
| update   | `aws_security_group.ai-answers-docdb-sg`                  |
| recreate | `aws_docdb_cluster_instance.ai-answers-docdb-instance[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_docdb_cluster_instance.ai-answers-docdb-instance[0] must be replaced
-/+ resource "aws_docdb_cluster_instance" "ai-answers-docdb-instance" {
      ~ arn                             = "arn:aws:rds:ca-central-1:992382783569:db:ai-answers-docdb-instance-0" -> (known after apply)
      ~ availability_zone               = "ca-central-1b" -> (known after apply)
      ~ ca_cert_identifier              = "rds-ca-rsa2048-g1" -> (known after apply)
      - copy_tags_to_snapshot           = false -> null
      ~ db_subnet_group_name            = "ai-answers-example-docdb-subnet-group" -> (known after apply)
      ~ dbi_resource_id                 = "db-XJGYCDORZFIOX5URNVTD6DOSEA" -> (known after apply)
      ~ endpoint                        = "ai-answers-docdb-instance-0.c52kwceay79r.ca-central-1.docdb.amazonaws.com" -> (known after apply)
      ~ engine_version                  = "5.0.0" -> (known after apply)
      ~ id                              = "ai-answers-docdb-instance-0" -> (known after apply)
      ~ identifier                      = "ai-answers-docdb-instance-0" -> "ai-answers-docdb-instance" # forces replacement
      + identifier_prefix               = (known after apply)
      ~ instance_class                  = "db.r5.large" -> "db.t3.medium"
      ~ kms_key_id                      = "arn:aws:kms:ca-central-1:992382783569:key/6e7e18d6-9977-4952-833a-1ab88280e9c3" -> (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      ~ port                            = 27017 -> (known after apply)
      ~ preferred_backup_window         = "04:01-04:31" -> (known after apply)
      ~ preferred_maintenance_window    = "thu:06:08-thu:06:38" -> (known after apply)
      ~ publicly_accessible             = false -> (known after apply)
      ~ storage_encrypted               = true -> (known after apply)
      ~ tags                            = {
            "CostCentre" = "ai-answers-staging"
          - "Temporary"  = "true" -> null
            "Terraform"  = "true"
        }
      ~ tags_all                        = {
          - "Temporary"  = "true" -> null
            # (2 unchanged elements hidden)
        }
      ~ writer                          = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_docdb_cluster_instance.ai-answers-docdb-instance[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_docdb_cluster_instance" "ai-answers-docdb-instance" {
      - apply_immediately            = true -> null
      - arn                          = "arn:aws:rds:ca-central-1:992382783569:db:ai-answers-docdb-instance-1" -> null
      - auto_minor_version_upgrade   = true -> null
      - availability_zone            = "ca-central-1a" -> null
      - ca_cert_identifier           = "rds-ca-rsa2048-g1" -> null
      - cluster_identifier           = "ai-answers-docdb-cluster" -> null
      - copy_tags_to_snapshot        = false -> null
      - db_subnet_group_name         = "ai-answers-example-docdb-subnet-group" -> null
      - dbi_resource_id              = "db-AVQ6TXMTOGB4NHYDCRN3ENON4U" -> null
      - endpoint                     = "ai-answers-docdb-instance-1.c52kwceay79r.ca-central-1.docdb.amazonaws.com" -> null
      - engine                       = "docdb" -> null
      - engine_version               = "5.0.0" -> null
      - id                           = "ai-answers-docdb-instance-1" -> null
      - identifier                   = "ai-answers-docdb-instance-1" -> null
      - instance_class               = "db.r5.large" -> null
      - kms_key_id                   = "arn:aws:kms:ca-central-1:992382783569:key/6e7e18d6-9977-4952-833a-1ab88280e9c3" -> null
      - port                         = 27017 -> null
      - preferred_backup_window      = "04:01-04:31" -> null
      - preferred_maintenance_window = "fri:08:08-fri:08:38" -> null
      - promotion_tier               = 0 -> null
      - publicly_accessible          = false -> null
      - storage_encrypted            = true -> null
      - tags                         = {
          - "CostCentre" = "ai-answers-staging"
          - "Temporary"  = "true"
          - "Terraform"  = "true"
        } -> null
      - tags_all                     = {
          - "CostCentre" = "ai-answers-staging"
          - "Temporary"  = "true"
          - "Terraform"  = "true"
        } -> null
      - writer                       = true -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.ai-answers-docdb-sg will be updated in-place
  ~ resource "aws_security_group" "ai-answers-docdb-sg" {
        id                     = "sg-04966047bf236b850"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 27017
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow DocumentDB cluster to receive requests from ECS"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-085c606383f33733e",
                ]
              - self             = false
              - to_port          = 27017
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
        name                   = "ai-answers-example-docdb-sg"
        tags                   = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.docdb_uri"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
